{
  "transformers_version": "5.13.1",
  "architectures": null,
  "output_hidden_states": false,
  "return_dict": true,
  "dtype": "bfloat16",
  "chunk_size_feed_forward": 0,
  "is_encoder_decoder": false,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1"
  },
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1
  },
  "problem_type": null,
  "vocab_size": 256,
  "hidden_size": 128,
  "intermediate_size": 256,
  "num_hidden_layers": 2,
  "num_attention_heads": 4,
  "num_key_value_heads": 2,
  "head_dim": 32,
  "hidden_act": "silu",
  "max_position_embeddings": 32768,
  "initializer_range": 0.02,
  "rms_norm_eps": 1e-06,
  "use_cache": true,
  "tie_word_embeddings": true,
  "rope_parameters": {
    "rope_theta": 10000.0,
    "rope_type": "default"
  },
  "attention_bias": false,
  "use_sliding_window": false,
  "sliding_window": null,
  "max_window_layers": 28,
  "layer_types": [
    "full_attention",
    "full_attention"
  ],
  "attention_dropout": 0.0,
  "pad_token_id": null,
  "bos_token_id": null,
  "eos_token_id": null,
  "_name_or_path": "",
  "model_type": "qwen3",
  "output_attentions": false
}